--[[---------------------------------------------------------------------------
Отключённые стандартные элементы DarkRP
---------------------------------------------------------------------------

DarkRP поставляется с кучей стандартных вещей:
    - множество модулей
    - стандартные профессии
    - ящики (шипменты) и оружие
    - энтити (например, денежный принтер)
    и многое другое

Если хотите отключить или заменить стандартные вещи — отключайте их здесь.

Примечание: если вы хотите, например, изменить официальную профессию медика, вы ОБЯЗАНЫ отключить стандартную в этом файле!
Затем скопируйте медика из DarkRP и вставьте в darkrp_customthings/jobs.lua
---------------------------------------------------------------------------]]


--[[---------------------------------------------------------------------------
Список отключённых модулей. true — отключить, false — включить.
Модули, которых нет в этом списке, включены по умолчанию.
Некоторые сторонние аддоны могут заменять один из модулей ниже и ожидать, что он включён.
В таких редких случаях это будет очевидно: вы ждёте, что что-то произойдёт, а ничего не происходит.
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["modules"] = {
    ["afk"]              = true,  -- режим AFK
    ["chatsounds"]       = true,  -- звуки в чате
    ["events"]           = true,  -- события (метеориты, землетрясения и т.п.)
    ["fpp"]              = false, -- Falco's Prop Protection (защита пропов)
    ["f1menu"]           = false, -- F1-меню
    ["f4menu"]           = false, -- F4-меню
    ["hitmenu"]          = true,  -- меню заказов (киллеры)
    ["hud"]              = false, -- HUD
    ["hungermod"]        = false, -- голод
    ["playerscale"]      = true,  -- масштаб игроков
    ["sleep"]            = true,  -- сон
    ["fadmin"]           = true,  -- админ-мод FAdmin
    ["animations"]       = true,  -- анимации
    ["chatindicator"]    = true,  -- индикатор набора текста
}

--[[---------------------------------------------------------------------------
Отключённые стандартные профессии. true — отключить, false — включить.

ПРИМЕЧАНИЕ: если вы отключите профессию и пересоздадите её, то всё, что на неё опирается, может перестать работать.
Например, вы отключили торговца оружием и сделали новую профессию TEAM_GUN. Чтобы ящики/группы дверей/и т.д.
работали для вашей профессии, пересоздайте их тоже, указав там свою профессию.
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["jobs"] = {
    ["chief"]     = true,
    ["citizen"]   = true,
    ["cook"]      = true, -- Только с Hungermod
    ["cp"]        = true,
    ["gangster"]  = true,
    ["gundealer"] = true,
    ["hobo"]      = true,
    ["mayor"]     = true,
    ["medic"]     = true,
    ["mobboss"]   = true,
}

--[[---------------------------------------------------------------------------
Ящики (шипменты) и пистолеты
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["shipments"] = {
    ["AK47"]         = true,
    ["Desert eagle"] = true,
    ["Fiveseven"]    = true,
    ["Glock"]        = true,
    ["M4"]           = true,
    ["Mac 10"]       = true,
    ["MP5"]          = true,
    ["P228"]         = true,
    ["Pump shotgun"] = true,
    ["Sniper rifle"] = true,
}

--[[---------------------------------------------------------------------------
Энтити
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["entities"] = {
    ["Drug lab"]      = true,
    ["Gun lab"]       = true,
    ["Money printer"] = true,
    ["Microwave"]     = true, -- Только с Hungermod
    ["Tip Jar"]       = true,
}

--[[---------------------------------------------------------------------------
Транспорт
(на данный момент стандартного транспорта нет)
Можно использовать, чтобы отключить транспорт, добавленный в vehicles.lua в папке darkrp_customthings.
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["vehicles"] = {

}

--[[---------------------------------------------------------------------------
Еда
Еда включена только при включённом hungermod (см. отключённые модули выше).
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["food"] = {
    ["Banana"]           = true,
    ["Bunch of bananas"] = true,
    ["Melon"]            = true,
    ["Glass bottle"]     = true,
    ["Pop can"]          = true,
    ["Plastic bottle"]   = true,
    ["Milk"]             = true,
    ["Bottle 1"]         = true,
    ["Bottle 2"]         = true,
    ["Bottle 3"]         = true,
    ["Orange"]           = true,
}

--[[---------------------------------------------------------------------------
Группы дверей
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["doorgroups"] = {
    ["Cops and Mayor only"] = true,
    ["Gundealer only"]      = true,
}


--[[---------------------------------------------------------------------------
Коробки с патронами
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["ammo"] = {
    ["Pistol ammo"]  = true,
    ["Rifle ammo"]   = true,
    ["Shotgun ammo"] = true,
}

--[[---------------------------------------------------------------------------
Повестки (agenda)
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["agendas"] = {
    ["Gangster's agenda"] = true,
    ["Police agenda"] = true,
}

--[[---------------------------------------------------------------------------
Групповые чаты (чат через /g)
У групповых чатов нет имён, поэтому используется их номер.
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["groupchat"] = {
    [1] = true, -- Чат полиции (мэр, полицейские, шеф и/или ваши полицейские профессии)
    [2] = true, -- Чат бандитов и главы мафии
    [3] = true, -- Чат между игроками одной профессии
}

--[[---------------------------------------------------------------------------
Профессии-киллеры
true — отключить
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["hitmen"] = {
    ["mobboss"] = true,
}

--[[---------------------------------------------------------------------------
Группы увольнения
Если кого-то уволили с любой профессии из группы, он временно не сможет
взять ни одну профессию из этой группы
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["demotegroups"] = {
    ["Cops"]      = true,
    ["Gangsters"] = true,
}

--[[---------------------------------------------------------------------------
Обходные исправления (workarounds)

DarkRP обходит некоторые баги GMod и других аддонов, которые не поддерживаются
(как следует). Если отключить исправления, эти баги вернутся.
---------------------------------------------------------------------------]]
DarkRP.disabledDefaults["workarounds"] = {
    ["os.date() Windows crash"]                      = false,
    ["SkidCheck"]                                    = false,
    ["Error on edict limit"]                         = false,
    ["Durgz witty sayings"]                          = false,
    ["ULX /me command"]                              = false,
    ["gm_save"]                                      = false,
    ["rp_downtown_v4c_v2 rooftop spawn"]             = false,
    ["White flashbang flashes"]                      = false,
    ["APAnti"]                                       = false,
    ["Wire field generator exploit fix"]             = false,
    ["Door tool class fix"]                          = false,
    ["Constraint crash exploit fix"]                 = false,
    ["Deprecated console commands"]                  = false,
    ["disable CAC"]                                  = false,
}
