--[[---------------------------------------------------------------------------
Лицензионное оружие
Добавьте сюда оружие, для которого НЕ нужна специальная лицензия.
ВСЁ остальное оружие будет требовать лицензию.

Примечание: работает, только если включена настройка license (в settings.lua).
---------------------------------------------------------------------------]]
GM.NoLicense["weapon_physcannon"] = true
GM.NoLicense["weapon_physgun"]    = true
GM.NoLicense["weapon_bugbait"]    = true
GM.NoLicense["gmod_tool"]         = true
GM.NoLicense["gmod_camera"]       = true
