RP_MySQLConfig = {} -- Не обращайте внимания на эту строку
--[[
Добро пожаловать в MySQL для DarkRP!
В этом файле находится инструкция по настройке MySQL и сами настройки MySQL.
 ]]


RP_MySQLConfig.EnableMySQL = false -- true — использовать внешнюю базу MySQL, false — встроенную базу SQLite Garry's mod (garrysmod/sv.db).
RP_MySQLConfig.Host = "127.0.0.1" -- IP-адрес хоста MySQL. Убедитесь, что IP правильный и указан в кавычках (" ")
RP_MySQLConfig.Username = "user" -- Имя пользователя для входа на сервер MySQL.
                                -- Логин и пароль узнайте у владельца сервера. Обязательно в кавычках! (" ")
RP_MySQLConfig.Password = "password" -- Пароль для входа на сервер MySQL.
                                    -- Этот пароль может прочитать любой, у кого есть доступ к FTP сервера.
                                    -- Хорошо подумайте, кому доверяете. Обязательно в кавычках (" ")
RP_MySQLConfig.Database_name = "DarkRP" -- Название базы данных на сервере MySQL. Узнайте его у хостера MySQL
RP_MySQLConfig.Database_port = 3306 -- Порт сервера MySQL. Если не знаете — тоже уточните у хостера MySQL.
RP_MySQLConfig.Preferred_module = "mysqloo" -- Предпочтительный модуль, регистр важен: "mysqloo" или "tmysql4". Учитывается, только если установлены оба.
RP_MySQLConfig.MultiStatements = false -- Только для tmysql4: разрешить несколько SQL-запросов в одном. Ни на что не влияет, если скрипты это не используют.


--[[
ИНСТРУКЦИЯ!
КАК ИСПОЛЬЗОВАТЬ MySQL ДЛЯ DARKRP!
Скачайте MySQLOO и прочитайте руководство здесь:
https://github.com/FredyH/MySQLOO

ЧТО ДЕЛАТЬ, ЕСЛИ НЕ РАБОТАЕТ!
    - На сервере всегда есть ошибки, попробуйте их найти (в HLDS/логах сервера)
    - Те же ошибки пишутся в логи, если не можете найти их на сервере.
        Логи лежат в garrysmod/data/DarkRP_logs/ на СЕРВЕРЕ!
        Строки MySQL в логе всегда начинаются с "MySQL Error:" (без кавычек)
    - Проверьте, что настройки в этом файле (mysql.lua) верны
    - Проверьте, что сервер MySQL доступен с IP вашего сервера
]]
