--[[---------------------------------------------------------------------------
Повестки (Agenda) DarkRP
---------------------------------------------------------------------------
Повестку устанавливает её менеджер; читать её могут сам менеджер и связанные с ней профессии.


КАК СОЗДАТЬ ПОВЕСТКУ:
AddAgenda(Название повестки, Менеджер (кто её редактирует), {Слушатели (те, кто только видит повестку и следует ей)})
---------------------------------------------------------------------------]]
-- Пример: AddAgenda("Gangster's agenda", TEAM_MOB, {TEAM_GANG})
-- Пример: AddAgenda("Police agenda", TEAM_MAYOR, {TEAM_CHIEF, TEAM_POLICE})
