--[[---------------------------------------------------------------------------
Группы увольнения
---------------------------------------------------------------------------
Когда увольняют шефа полиции, обычно не хочется, чтобы ему запретили становиться и обычным полицейским.
Для этого и нужны группы увольнения.

Если кого-то из группы уволили, ему запрещается брать КАЖДУЮ профессию из этой группы.
Примеры ниже — это стандартные группы увольнения.

КАК СОЗДАТЬ ГРУППУ УВОЛЬНЕНИЯ:
DarkRP.createDemoteGroup("Название группы", {TEAM1, TEAM2})
---------------------------------------------------------------------------]]


-- Пример: DarkRP.createDemoteGroup("Cops", {TEAM_POLICE, TEAM_CHIEF})
-- Пример: DarkRP.createDemoteGroup("Gangsters", {TEAM_GANG, TEAM_MOB})
