--[[---------------------------------------------------------------------------
Группы дверей
---------------------------------------------------------------------------
Владелец сервера может назначить определённые двери группе людей по их профессиям.


КАК СОЗДАТЬ ГРУППУ ДВЕРЕЙ:
AddDoorGroup("НАЗВАНИЕ ГРУППЫ, его видно, когда смотришь на дверь", Team1, Team2, team3, team4, и т.д.)
---------------------------------------------------------------------------]]


-- Пример: AddDoorGroup("Cops and Mayor only", TEAM_CHIEF, TEAM_POLICE, TEAM_MAYOR)
-- Пример: AddDoorGroup("Gundealer only", TEAM_GUN)
