--[[---------------------------------------------------------------------------
Свои энтити (предметы) DarkRP
---------------------------------------------------------------------------

В этом файле находятся ваши собственные энтити.
Также сюда нужно класть стандартные энтити DarkRP, которые вы изменили.

Примечание: чтобы изменить стандартную энтити DarkRP, сначала отключите её в darkrp_config/disabled_defaults.lua
    После этого скопируйте энтити в этот файл и редактируйте.

Стандартные энтити можно найти здесь:
https://github.com/FPtje/DarkRP/blob/master/gamemode/config/addentities.lua

Примеры и пояснения на этой вики-странице:
https://darkrp.miraheze.org/wiki/DarkRP:CustomEntityFields

Добавляйте энтити под следующей строкой:
---------------------------------------------------------------------------]]
