--[[---------------------------------------------------------------------------
Своя еда DarkRP
---------------------------------------------------------------------------

В этом файле находится ваша собственная еда.
Также сюда нужно класть стандартную еду DarkRP, которую вы изменили.

ЭТОТ ФАЙЛ ЗАГРУЖАЕТСЯ, ТОЛЬКО ЕСЛИ HUNGERMOD ВКЛЮЧЁН В darkrp_config/disabled_defaults.lua.
ПО УМОЛЧАНИЮ ОН ВЫКЛЮЧЕН.

Примечание: чтобы изменить стандартную еду DarkRP, сначала отключите её в darkrp_config/disabled_defaults.lua
    После этого скопируйте еду в этот файл и редактируйте.

Стандартную еду можно найти здесь:
https://github.com/FPtje/DarkRP/blob/master/gamemode/modules/hungermod/sh_init.lua#L33

Добавляйте еду под следующей строкой:
---------------------------------------------------------------------------]]
DarkRP.createFood("Banana", {
    model = "models/props/cs_italy/bananna.mdl",
    energy = 10,
    price = 10
})