--[[---------------------------------------------------------------------------
Групповые чаты
---------------------------------------------------------------------------
Командный чат для определённых профессий.
Например, в стандартном полицейском чате офицеры, шефы и мэры могут
общаться друг с другом через /g или командный чат.

КАК СОЗДАТЬ ГРУППОВОЙ ЧАТ:
Простой способ:
GAMEMODE:AddGroupChat(Список переменных профессий через запятую)

Продвинутый способ:
GAMEMODE:AddGroupChat(функция с аргументом ply, которая возвращает, состоит ли игрок в этом чате)
Это для тех, кто умеет писать на Lua.

---------------------------------------------------------------------------]]
-- Пример: GAMEMODE:AddGroupChat(TEAM_MOB, TEAM_GANG)
-- Пример: GAMEMODE:AddGroupChat(function(ply) return ply:isCP() end)
