--[[---------------------------------------------------------------------------
Свои ящики (шипменты) и оружие DarkRP
---------------------------------------------------------------------------

В этом файле находятся ваши собственные ящики и оружие.
Также сюда нужно класть стандартные ящики и оружие DarkRP, которые вы изменили.

Примечание: чтобы изменить стандартный ящик DarkRP, сначала отключите его в darkrp_config/disabled_defaults.lua
    После этого скопируйте ящик в этот файл и редактируйте.

Стандартные ящики и оружие можно найти здесь:
https://github.com/FPtje/DarkRP/blob/master/gamemode/config/addentities.lua

Примеры и пояснения на этой вики-странице:
https://darkrp.miraheze.org/wiki/DarkRP:CustomShipmentFields


Добавляйте ящики и оружие под следующей строкой:
---------------------------------------------------------------------------]]
