--[[---------------------------------------------------------------------------
Свой транспорт DarkRP
---------------------------------------------------------------------------

В этом файле находится ваш собственный транспорт.
Также сюда нужно класть стандартный транспорт DarkRP, который вы изменили.

Примеры и пояснения на этой вики-странице:
https://darkrp.miraheze.org/wiki/DarkRP:Vehicles

Если хотите сохранить код транспорта, но не закомментировать его, можно добавить транспорт в раздел "DarkRP.disabledDefaults["vehicles"]"
в файле disabled_defaults.lua в папке "darkrp_config"

Добавляйте транспорт под следующей строкой:
---------------------------------------------------------------------------]]
